tap "atlassian/acli"
tap "codecrafters-io/tap"
tap "databricks/tap"
tap "hginsights/tap"
tap "jundot/omlx", "https://github.com/jundot/omlx"

# Core utilities
brew "ack"
brew "cmake"
brew "curl"
brew "direnv"
brew "grep"
brew "tmux"
brew "tree"

# Git
brew "git"
brew "git-lfs"
brew "gh"

# JSON / data
brew "jq"

# Shell
brew "pre-commit"

# Python
brew "pyenv"
brew "pipx"
brew "uv"
brew "pypy"
brew "python@3.11"

# Python build deps
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

# Node
brew "node"

# Rust
brew "rust"

# Kubernetes / DevOps
brew "tflint"

# AWS
brew "awscli"
brew "gimme-aws-creds"

# Scala / JVM
brew "apache-spark"
brew "sbt"
brew "scala"

# Languages
brew "elixir"

# AI / LLM
brew "ollama"
brew "jundot/omlx/omlx"

# Work tools
brew "atlassian/acli/acli"
brew "codecrafters-io/tap/codecrafters"
brew "databricks/tap/databricks"
brew "hginsights/tap/gimme-snowflake-creds"
brew "jfrog-cli"

# Misc
brew "asdf"
brew "rtk"

# ------- Apps -------

# Productivity
cask "1password"
cask "appcleaner"
cask "arc"
cask "asana"
cask "calibre"
cask "clipy"
cask "notion"
cask "obsidian"
cask "rectangle"

# Dev tools
cask "boop"
cask "clickhouse"
cask "cursor"
cask "docker"
cask "ghostty"
cask "github"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyboardcleantool"
cask "lm-studio"
cask "postman"
cask "sublime-text"
cask "visual-studio-code"

# System / menu bar
cask "caffeine"
cask "cloudflare-warp"
cask "keepingyouawake"
cask "logi-options-plus"
cask "monitorcontrol"
cask "stats"

# AI tools
cask "claude"

# Communication
cask "slack"
cask "zoom"

# Microsoft
cask "microsoft-office"
cask "windows-app"

# Media
cask "firefox"
cask "google-chrome"
cask "vlc"

# VSCode extensions (installed automatically by `brew bundle`)
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "iampeterbanjo.elixirlinter"
vscode "jakebecker.elixir-ls"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "pgourlain.erlang"
vscode "redhat.java"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "samuel-pordeus.elixir-test"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
