alssys.interactive-scala
anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-ssh
concretio.markdown-for-humans
docker.docker
eamodio.gitlens
github.vscode-github-actions
hashicorp.terraform
k--kato.intellij-idea-keybindings
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
redhat.java
redhat.vscode-yaml
scala-lang.scala
scala-lang.scala-snippets
scalameta.metals
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
zhuangtongfa.material-theme
