docker.docker
eamodio.gitlens
formulahendry.code-runner
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
iampeterbanjo.elixirlinter
jakebecker.elixir-ls
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
pgourlain.erlang
redhat.java
renesaarsoo.sql-formatter-vsc
samuel-pordeus.elixir-test
scala-lang.scala
scalameta.metals
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
